tests/artillery-load.yml
config:
  target: https://dev-coolify.farville.farm
  phases:
    # create 1 virtual user per second, for a total duration of 1 minute
    - name: "1vu/s for 1min"
      duration: 60
      arrivalRate: 1
    # create 50 virtual user per second, for a total duration of 10 minutes
    # - name: "50vu/s for 5min"
    #   duration: 300
    #   arrivalRate: 50
  ensure:
    maxErrorRate: 1
    max: 500
  # plugins:
  #   metrics-by-endpoint: {}


scenarios:
  - name: "test_buy_harvest_sell"
    flow:
      - post:
          url: '/api/sign-in'
          json:
            signature: "0x123"
            message: "<3 from test mode"
            fid: null
            referrerFid: null
          capture:
            - json: $.token
              as: authToken

      # Buy 4 carrot seeds
      - post:
          url: "/api/users/me/items/1/"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "buy"
            itemId: 1
            mode: "classic"
            quantity: 4

      # Plant 4 carrot seeds
      - post:
          url: "/api/grid-bulk"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "plant"
            itemSlug: "carrot-seeds"
            mode: "classic"
            cells: [
              {
                x: 0,
                y: 0
              },
              {
                x: 1,
                y: 0
              },
              {
                x: 0,
                y: 1
              },
              {
                x: 1,
                y: 1
              },
            ]
      
      # Pause for 4 seconds
      - think: 4

      # Harvest carrots
      - post:
          url: "/api/grid-bulk"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "harvest"
            itemSlug: "carrot-seeds"
            mode: "classic"
            cells: [
              {
                x: 0,
                y: 0
              },
              {
                x: 1,
                y: 0
              },
              {
                x: 0,
                y: 1
              },
              {
                x: 1,
                y: 1
              },
            ]

      # Pause for 10 seconds
      - think: 10

      # Sell 4 carrots
      - post:
          url: "/api/users/me/items/1"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "sell"
            itemId: 1
            mode: "classic"
            quantity: 4