tests/farville-artillery-load.yml
config:
  target: https://dev-coolify.farville.farm
  http:
    timeout: 200
  plugins:
    metrics-by-endpoint: {}
  phases:
    # create 1 virtual user per second, for a total duration of 1 minute
    - name: "1vu/s for 60s"
      duration: 60
      arrivalRate: 1
      maxVusers: 100
    # create 240 users: 2 virtual user per second, for a total duration of 2 minutes
    # - name: "2vu/s for 2min"
    #   duration: 120
    #   arrivalRate: 2
    # create 1500 users: 5 virtual user per second, for a total duration of 5 minutes
    # - name: "5vu/s for 5min"
    #   duration: 300
    #   arrivalRate: 5
    # create 1500 users: 50 virtual user per second, for a total duration of 10 minutes
    # - name: "50vu/s for 5min"
    #   duration: 300
    #   arrivalRate: 50


scenarios:
  - name: "test_buy_harvest_sell"
    flow:
      - post:
          url: '/api/sign-in'
          json:
            signature: "0x123"
            message: "<3 from test mode"
            fid: null
            referrerFid: null
          capture:
            - json: $.token
              as: authToken

      # Buy 36 carrot-seeds (itemId 1)
      - post:
          url: "/api/users/me/items/1/"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "buy"
            itemId: 1
            mode: "classic"
            quantity: 36
          capture:
            - json: $.message
              as: buyMessage
            # - json: $.error
            #   as: buyError
            #   strict: false
      - log: "buy msg: {{buyMessage}}"
      # buy error {{buyError}}"

      # Plant 36 carrot-seeds (itemId 1)
      - log: "start planting..."
      - post:
          url: "/api/grid-bulk"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "plant"
            itemSlug: "carrot-seeds"
            mode: "classic"
            cells: [
              {
                x: 1,
                y: 1
              },
              {
                x: 2,
                y: 1
              },
              {
                x: 3,
                y: 1
              },
              {
                x: 4,
                y: 1
              },
              {
                x: 5,
                y: 1
              },
              {
                x: 6,
                y: 1
              },
              {
                x: 1,
                y: 2
              },
              {
                x: 2,
                y: 2
              },
              {
                x: 3,
                y: 2
              },
              {
                x: 4,
                y: 2
              },
              {
                x: 5,
                y: 2
              },
              {
                x: 6,
                y: 2
              },
              {
                x: 1,
                y: 3
              },
              {
                x: 2,
                y: 3
              },
              {
                x: 3,
                y: 3
              },
              {
                x: 4,
                y: 3
              },
              {
                x: 5,
                y: 3
              },
              {
                x: 6,
                y: 3
              },
              {
                x: 1,
                y: 4
              },
              {
                x: 2,
                y: 4
              },
              {
                x: 3,
                y: 4
              },
              {
                x: 4,
                y: 4
              },
              {
                x: 5,
                y: 4
              },
              {
                x: 6,
                y: 4
              },
              {
                x: 1,
                y: 5
              },
              {
                x: 2,
                y: 5
              },
              {
                x: 3,
                y: 5
              },
              {
                x: 4,
                y: 5
              },
              {
                x: 5,
                y: 5
              },
              {
                x: 6,
                y: 5
              },
              {
                x: 1,
                y: 6
              },
              {
                x: 2,
                y: 6
              },
              {
                x: 3,
                y: 6
              },
              {
                x: 4,
                y: 6
              },
              {
                x: 5,
                y: 6
              },
              {
                x: 6,
                y: 6
              }
            ]
          capture:
            - json: $.data.cells.ok
              as: plantedCellsOk
            - json: $.data.cells.nok
              as: plantedCellsNotOk
            # - json: $.error
            #   as: plantedError1
            #   strict: false
            # - json: $.data.error
            #   as: plantedError2
            #   strict: false
      - log: "planted cells\nplant ok: {{plantedCellsOk}}\nplant nok: {{plantedCellsNotOk}}"
      # \nplant error 1: {{plantedError1}} 2: {{plantedError2}}"
      
      # Harvest 36 carrot-seeds (itemId 1)
      - log: "start harvesting..."
      - post:
          url: "/api/grid-bulk"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "harvest"
            itemSlug: "carrot-seeds"
            mode: "classic"
            cells: [
              {
                x: 1,
                y: 1
              },
              {
                x: 2,
                y: 1
              },
              {
                x: 3,
                y: 1
              },
              {
                x: 4,
                y: 1
              },
              {
                x: 5,
                y: 1
              },
              {
                x: 6,
                y: 1
              },
              {
                x: 1,
                y: 2
              },
              {
                x: 2,
                y: 2
              },
              {
                x: 3,
                y: 2
              },
              {
                x: 4,
                y: 2
              },
              {
                x: 5,
                y: 2
              },
              {
                x: 6,
                y: 2
              },
              {
                x: 1,
                y: 3
              },
              {
                x: 2,
                y: 3
              },
              {
                x: 3,
                y: 3
              },
              {
                x: 4,
                y: 3
              },
              {
                x: 5,
                y: 3
              },
              {
                x: 6,
                y: 3
              },
              {
                x: 1,
                y: 4
              },
              {
                x: 2,
                y: 4
              },
              {
                x: 3,
                y: 4
              },
              {
                x: 4,
                y: 4
              },
              {
                x: 5,
                y: 4
              },
              {
                x: 6,
                y: 4
              },
              {
                x: 1,
                y: 5
              },
              {
                x: 2,
                y: 5
              },
              {
                x: 3,
                y: 5
              },
              {
                x: 4,
                y: 5
              },
              {
                x: 5,
                y: 5
              },
              {
                x: 6,
                y: 5
              },
              {
                x: 1,
                y: 6
              },
              {
                x: 2,
                y: 6
              },
              {
                x: 3,
                y: 6
              },
              {
                x: 4,
                y: 6
              },
              {
                x: 5,
                y: 6
              },
              {
                x: 6,
                y: 6
              }
            ]
          capture:
            - json: $.data.cells.ok
              as: harvestCellsOk
            - json: $.data.cells.nok
              as: harvestCellsNotOk
            # - json: $.error
            #   as: harvestError1
            #   strict: false
            # - json: $.data.error
            #   as: harvestError2
            #   strict: false
      - log: "harvested cells\nharvest ok: {{harvestCellsOk}}\nharvest nok: {{harvestCellsNotOk}}"
      #\nharvest error 1: {{harvestError1}} 2: {{harvestError2}}"

      # Sell 36 carrots (itemId 5)
      - log: "start selling..."
      - post:
          url: "/api/users/me/items/1"
          headers:
            Authorization: "Bearer {{authToken}}"
          json:
            action: "sell"
            itemId: 5
            mode: "classic"
            quantity: 36
          capture:
            - json: $.message
              as: sellMessage
            # - json: $.error
            #   as: sellError
            #   strict: false
      - log: "sell msg: {{sellMessage}}"
      # \nbuy error {{sellError}}"